; ModuleID = 'lib/bpf/balancer.bpf.c'
source_filename = "lib/bpf/balancer.bpf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.anon = type { [2 x i32]*, i32*, %struct.ctl_value*, [16 x i32]*, [0 x i32]* }
%struct.ctl_value = type { %union.anon }
%union.anon = type { i64 }
%struct.anon.0 = type { [1 x i32]*, %struct.vip_definition*, %struct.vip_meta*, [512 x i32]*, [0 x i32]* }
%struct.vip_definition = type { %union.anon.1, i16, i8 }
%union.anon.1 = type { [4 x i32] }
%struct.vip_meta = type { i32, i32 }
%struct.anon.2 = type { [9 x i32]*, %struct.flow_key*, %struct.real_pos_lru*, [1000 x i32]*, [0 x i32]* }
%struct.flow_key = type { %union.anon.3, %union.anon.4, %union.anon.5, i8 }
%union.anon.3 = type { [4 x i32] }
%union.anon.4 = type { [4 x i32] }
%union.anon.5 = type { i32 }
%struct.real_pos_lru = type { i32, i64 }
%struct.anon.6 = type { [12 x i32]*, i32*, i32*, [128 x i32]*, [0 x i32]*, [0 x %struct.anon.7*] }
%struct.anon.7 = type { [9 x i32]*, %struct.flow_key*, %struct.real_pos_lru*, [1000 x i32]* }
%struct.anon.8 = type { [2 x i32]*, i32*, i32*, [33554944 x i32]*, [0 x i32]* }
%struct.anon.9 = type { [2 x i32]*, i32*, %struct.real_definition*, [4096 x i32]*, [0 x i32]* }
%struct.real_definition = type { %union.anon.10, i8 }
%union.anon.10 = type { [4 x i32] }
%struct.anon.11 = type { [6 x i32]*, i32*, %struct.lb_stats*, [4096 x i32]*, [0 x i32]* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 1047, type: !400, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !46, globals: !76, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "lib/bpf/balancer.bpf.c", directory: "/home/yunwei/ebpf-xdp-dpdk/katran", checksumkind: CSK_MD5, checksum: "cef5ef7142fe35d71b8c6f4584031e71")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 3112, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "lib/bpf/../linux_includes/bpf.h", directory: "/home/yunwei/ebpf-xdp-dpdk/katran", checksumkind: CSK_MD5, checksum: "ff48857d6d73cdf09cad1f57c866ec2d")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 29, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "fcee415bb19db8acb968eeda6f02fa29")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!38 = !DIEnumerator(name: "IPPROTO_L2TP", value: 115)
!39 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!40 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!41 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!42 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!43 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!44 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!45 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!46 = !{!47, !48, !49, !52, !53, !54, !67, !72, !73, !75}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!48 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !50, line: 24, baseType: !51)
!50 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!51 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !50, line: 27, baseType: !7)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quic_long_header", file: !56, line: 42, size: 112, elements: !57)
!56 = !DIFile(filename: "lib/bpf/../bpf/pckt_parsing.h", directory: "/home/yunwei/ebpf-xdp-dpdk/katran", checksumkind: CSK_MD5, checksum: "643f3a885b413981391244fdb0e04c7a")
!57 = !{!58, !61, !62, !63}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !55, file: !56, line: 43, baseType: !59, size: 8)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !50, line: 21, baseType: !60)
!60 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !55, file: !56, line: 44, baseType: !52, size: 32, offset: 8)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "conn_id_lens", scope: !55, file: !56, line: 47, baseType: !59, size: 8, offset: 40)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "dst_connection_id", scope: !55, file: !56, line: 51, baseType: !64, size: 64, offset: 48)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 64, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 8)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quic_short_header", file: !56, line: 54, size: 72, elements: !69)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !68, file: !56, line: 55, baseType: !59, size: 8)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "connection_id", scope: !68, file: !56, line: 56, baseType: !64, size: 64, offset: 8)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !74, line: 53, baseType: !7)
!74 = !DIFile(filename: "lib/bpf/../linux_includes/jhash.h", directory: "/home/yunwei/ebpf-xdp-dpdk/katran", checksumkind: CSK_MD5, checksum: "0265bf5dda796cc0b00270b27dc7a18e")
!75 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!76 = !{!0, !77, !115, !153, !195, !223, !236, !258, !274, !283, !292, !305, !330, !339, !352, !368, !377, !383, !388, !390, !395}
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "ctl_array", scope: !2, file: !79, line: 41, type: !80, isLocal: false, isDefinition: true)
!79 = !DIFile(filename: "lib/bpf/../bpf/control_data_maps.h", directory: "/home/yunwei/ebpf-xdp-dpdk/katran", checksumkind: CSK_MD5, checksum: "694353d1842f272bfdcdf960951d11fc")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 35, size: 320, elements: !81)
!81 = !{!82, !87, !89, !105, !110}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !79, line: 36, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 64, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 2)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !80, file: !79, line: 37, baseType: !88, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !80, file: !79, line: 38, baseType: !90, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_value", file: !92, line: 53, size: 64, elements: !93)
!92 = !DIFile(filename: "lib/bpf/../bpf/balancer_structs.h", directory: "/home/yunwei/ebpf-xdp-dpdk/katran", checksumkind: CSK_MD5, checksum: "40218bab4dbc992e5ede19a7d7e2b065")
!93 = !{!94}
!94 = !DIDerivedType(tag: DW_TAG_member, scope: !91, file: !92, line: 54, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !91, file: !92, line: 54, size: 64, elements: !96)
!96 = !{!97, !100, !101}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !95, file: !92, line: 55, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !50, line: 31, baseType: !99)
!99 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !95, file: !92, line: 56, baseType: !52, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !95, file: !92, line: 57, baseType: !102, size: 48)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 48, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 6)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !80, file: !79, line: 39, baseType: !106, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 512, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 16)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !80, file: !79, line: 40, baseType: !111, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 0)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "vip_map", scope: !2, file: !117, line: 38, type: !118, isLocal: false, isDefinition: true)
!117 = !DIFile(filename: "lib/bpf/../bpf/balancer_maps.h", directory: "/home/yunwei/ebpf-xdp-dpdk/katran", checksumkind: CSK_MD5, checksum: "41f180e67b07c157f1656c98d6855080")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 32, size: 320, elements: !119)
!119 = !{!120, !125, !141, !147, !152}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !118, file: !117, line: 33, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 32, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 1)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !118, file: !117, line: 34, baseType: !126, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vip_definition", file: !92, line: 62, size: 160, elements: !128)
!128 = !{!129, !139, !140}
!129 = !DIDerivedType(tag: DW_TAG_member, scope: !127, file: !92, line: 63, baseType: !130, size: 128)
!130 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !127, file: !92, line: 63, size: 128, elements: !131)
!131 = !{!132, !135}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !130, file: !92, line: 64, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !134, line: 34, baseType: !52)
!134 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "bf9fbc0e8f60927fef9d8917535375a6")
!135 = !DIDerivedType(tag: DW_TAG_member, name: "vipv6", scope: !130, file: !92, line: 65, baseType: !136, size: 128)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 128, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 4)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !127, file: !92, line: 67, baseType: !49, size: 16, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !127, file: !92, line: 68, baseType: !59, size: 8, offset: 144)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !118, file: !117, line: 35, baseType: !142, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vip_meta", file: !92, line: 72, size: 64, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !143, file: !92, line: 73, baseType: !52, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "vip_num", scope: !143, file: !92, line: 74, baseType: !52, size: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !118, file: !117, line: 36, baseType: !148, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 16384, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !118, file: !117, line: 37, baseType: !111, size: 64, offset: 256)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "fallback_cache", scope: !2, file: !117, line: 47, type: !155, isLocal: false, isDefinition: true)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 41, size: 320, elements: !156)
!156 = !{!157, !162, !183, !189, !194}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !155, file: !117, line: 42, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 288, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 9)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !155, file: !117, line: 43, baseType: !163, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_key", file: !92, line: 26, size: 320, elements: !165)
!165 = !{!166, !171, !176, !182}
!166 = !DIDerivedType(tag: DW_TAG_member, scope: !164, file: !92, line: 27, baseType: !167, size: 128)
!167 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !164, file: !92, line: 27, size: 128, elements: !168)
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !167, file: !92, line: 28, baseType: !133, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "srcv6", scope: !167, file: !92, line: 29, baseType: !136, size: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, scope: !164, file: !92, line: 31, baseType: !172, size: 128, offset: 128)
!172 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !164, file: !92, line: 31, size: 128, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !172, file: !92, line: 32, baseType: !133, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "dstv6", scope: !172, file: !92, line: 33, baseType: !136, size: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !164, file: !92, line: 35, baseType: !177, size: 32, offset: 256)
!177 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !164, file: !92, line: 35, size: 32, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ports", scope: !177, file: !92, line: 36, baseType: !52, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "port16", scope: !177, file: !92, line: 37, baseType: !181, size: 32)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 32, elements: !85)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !164, file: !92, line: 39, baseType: !59, size: 8, offset: 288)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !155, file: !117, line: 44, baseType: !184, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_pos_lru", file: !92, line: 78, size: 128, elements: !186)
!186 = !{!187, !188}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !185, file: !92, line: 79, baseType: !52, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !185, file: !92, line: 80, baseType: !98, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !155, file: !117, line: 45, baseType: !190, size: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 32000, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 1000)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !155, file: !117, line: 46, baseType: !111, size: 64, offset: 256)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "lru_mapping", scope: !2, file: !117, line: 64, type: !197, isLocal: false, isDefinition: true)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 50, size: 320, elements: !198)
!198 = !{!199, !204, !205, !206, !211, !212}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !197, file: !117, line: 51, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 384, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 12)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !197, file: !117, line: 52, baseType: !88, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !197, file: !117, line: 53, baseType: !88, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !197, file: !117, line: 54, baseType: !207, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 4096, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !197, file: !117, line: 55, baseType: !111, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !197, file: !117, line: 56, baseType: !213, offset: 320)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, elements: !221)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !197, file: !117, line: 56, size: 256, elements: !216)
!216 = !{!217, !218, !219, !220}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !215, file: !117, line: 56, baseType: !158, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !215, file: !117, line: 56, baseType: !163, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !215, file: !117, line: 56, baseType: !184, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !215, file: !117, line: 56, baseType: !190, size: 64, offset: 192)
!221 = !{!222}
!222 = !DISubrange(count: -1)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "ch_rings", scope: !2, file: !117, line: 73, type: !225, isLocal: false, isDefinition: true)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 67, size: 320, elements: !226)
!226 = !{!227, !228, !229, !230, !235}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !225, file: !117, line: 68, baseType: !83, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !225, file: !117, line: 69, baseType: !88, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !225, file: !117, line: 70, baseType: !88, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !225, file: !117, line: 71, baseType: !231, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 1073758208, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 33554944)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !225, file: !117, line: 72, baseType: !111, size: 64, offset: 256)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "reals", scope: !2, file: !117, line: 82, type: !238, isLocal: false, isDefinition: true)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 76, size: 320, elements: !239)
!239 = !{!240, !241, !242, !252, !257}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !238, file: !117, line: 77, baseType: !83, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !238, file: !117, line: 78, baseType: !88, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !238, file: !117, line: 79, baseType: !243, size: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_definition", file: !92, line: 84, size: 160, elements: !245)
!245 = !{!246, !251}
!246 = !DIDerivedType(tag: DW_TAG_member, scope: !244, file: !92, line: 85, baseType: !247, size: 128)
!247 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !244, file: !92, line: 85, size: 128, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !247, file: !92, line: 86, baseType: !133, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "dstv6", scope: !247, file: !92, line: 87, baseType: !136, size: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !244, file: !92, line: 89, baseType: !59, size: 8, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !238, file: !117, line: 80, baseType: !253, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 131072, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 4096)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !238, file: !117, line: 81, baseType: !111, size: 64, offset: 256)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "reals_stats", scope: !2, file: !117, line: 91, type: !260, isLocal: false, isDefinition: true)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 85, size: 320, elements: !261)
!261 = !{!262, !265, !266, !272, !273}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !260, file: !117, line: 86, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 192, elements: !103)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !260, file: !117, line: 87, baseType: !88, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !260, file: !117, line: 88, baseType: !267, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lb_stats", file: !92, line: 93, size: 128, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !268, file: !92, line: 94, baseType: !98, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !268, file: !92, line: 95, baseType: !98, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !260, file: !117, line: 89, baseType: !253, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !260, file: !117, line: 90, baseType: !111, size: 64, offset: 256)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "lru_miss_stats", scope: !2, file: !117, line: 100, type: !276, isLocal: false, isDefinition: true)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 94, size: 320, elements: !277)
!277 = !{!278, !279, !280, !281, !282}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !117, line: 95, baseType: !263, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !276, file: !117, line: 96, baseType: !88, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !276, file: !117, line: 97, baseType: !88, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !276, file: !117, line: 98, baseType: !253, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !276, file: !117, line: 99, baseType: !111, size: 64, offset: 256)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "vip_miss_stats", scope: !2, file: !117, line: 108, type: !285, isLocal: false, isDefinition: true)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 102, size: 320, elements: !286)
!286 = !{!287, !288, !289, !290, !291}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !285, file: !117, line: 103, baseType: !83, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !285, file: !117, line: 104, baseType: !88, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !285, file: !117, line: 105, baseType: !126, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !285, file: !117, line: 106, baseType: !121, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !285, file: !117, line: 107, baseType: !111, size: 64, offset: 256)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "stats", scope: !2, file: !117, line: 117, type: !294, isLocal: false, isDefinition: true)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 111, size: 320, elements: !295)
!295 = !{!296, !297, !298, !299, !304}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !294, file: !117, line: 112, baseType: !263, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !294, file: !117, line: 113, baseType: !88, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !294, file: !117, line: 114, baseType: !267, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !294, file: !117, line: 115, baseType: !300, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 32768, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 1024)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !294, file: !117, line: 116, baseType: !111, size: 64, offset: 256)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "quic_stats_map", scope: !2, file: !117, line: 126, type: !307, isLocal: false, isDefinition: true)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 120, size: 320, elements: !308)
!308 = !{!309, !310, !311, !328, !329}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !307, file: !117, line: 121, baseType: !263, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !307, file: !117, line: 122, baseType: !88, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !307, file: !117, line: 123, baseType: !312, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lb_quic_packets_stats", file: !92, line: 142, size: 832, elements: !314)
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ch_routed", scope: !313, file: !92, line: 143, baseType: !98, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "cid_initial", scope: !313, file: !92, line: 144, baseType: !98, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "cid_invalid_server_id", scope: !313, file: !92, line: 145, baseType: !98, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "cid_invalid_server_id_sample", scope: !313, file: !92, line: 146, baseType: !98, size: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "cid_routed", scope: !313, file: !92, line: 147, baseType: !98, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "cid_unknown_real_dropped", scope: !313, file: !92, line: 148, baseType: !98, size: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "cid_v0", scope: !313, file: !92, line: 149, baseType: !98, size: 64, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "cid_v1", scope: !313, file: !92, line: 150, baseType: !98, size: 64, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "cid_v2", scope: !313, file: !92, line: 151, baseType: !98, size: 64, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "cid_v3", scope: !313, file: !92, line: 152, baseType: !98, size: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "dst_match_in_lru", scope: !313, file: !92, line: 153, baseType: !98, size: 64, offset: 640)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "dst_mismatch_in_lru", scope: !313, file: !92, line: 154, baseType: !98, size: 64, offset: 704)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "dst_not_found_in_lru", scope: !313, file: !92, line: 155, baseType: !98, size: 64, offset: 768)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !307, file: !117, line: 124, baseType: !121, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !307, file: !117, line: 125, baseType: !111, size: 64, offset: 256)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "decap_vip_stats", scope: !2, file: !117, line: 135, type: !332, isLocal: false, isDefinition: true)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 129, size: 320, elements: !333)
!333 = !{!334, !335, !336, !337, !338}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !332, file: !117, line: 130, baseType: !263, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !332, file: !117, line: 131, baseType: !88, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !332, file: !117, line: 132, baseType: !267, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !332, file: !117, line: 133, baseType: !148, size: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !332, file: !117, line: 134, baseType: !111, size: 64, offset: 256)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "server_id_map", scope: !2, file: !117, line: 154, type: !341, isLocal: false, isDefinition: true)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 148, size: 320, elements: !342)
!342 = !{!343, !344, !345, !346, !351}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !341, file: !117, line: 149, baseType: !83, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !341, file: !117, line: 150, baseType: !88, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !341, file: !117, line: 151, baseType: !88, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !341, file: !117, line: 152, baseType: !347, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 536870848, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 16777214)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !341, file: !117, line: 153, baseType: !111, size: 64, offset: 256)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "tpr_stats_map", scope: !2, file: !117, line: 211, type: !354, isLocal: false, isDefinition: true)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 205, size: 320, elements: !355)
!355 = !{!356, !357, !358, !366, !367}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !354, file: !117, line: 206, baseType: !263, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !354, file: !117, line: 207, baseType: !88, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !354, file: !117, line: 208, baseType: !359, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lb_tpr_packets_stats", file: !92, line: 159, size: 256, elements: !361)
!361 = !{!362, !363, !364, !365}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ch_routed", scope: !360, file: !92, line: 160, baseType: !98, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dst_mismatch_in_lru", scope: !360, file: !92, line: 161, baseType: !98, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sid_routed", scope: !360, file: !92, line: 162, baseType: !98, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_syn", scope: !360, file: !92, line: 163, baseType: !98, size: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !354, file: !117, line: 209, baseType: !121, size: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !354, file: !117, line: 210, baseType: !111, size: 64, offset: 256)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "server_id_stats", scope: !2, file: !117, line: 219, type: !370, isLocal: false, isDefinition: true)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 213, size: 320, elements: !371)
!371 = !{!372, !373, !374, !375, !376}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !370, file: !117, line: 214, baseType: !263, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !370, file: !117, line: 215, baseType: !88, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !370, file: !117, line: 216, baseType: !267, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !370, file: !117, line: 217, baseType: !148, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !370, file: !117, line: 218, baseType: !111, size: 64, offset: 256)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !379, line: 23, type: !380, isLocal: true, isDefinition: true)
!379 = !DIFile(filename: "lib/bpf/../linux_includes/bpf_helpers.h", directory: "/home/yunwei/ebpf-xdp-dpdk/katran", checksumkind: CSK_MD5, checksum: "cefccbb365e20cc12b30d5a8caaf18f8")
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!47, !47, !47}
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "bpf_get_smp_processor_id", scope: !2, file: !379, line: 48, type: !385, isLocal: true, isDefinition: true)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!99}
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !379, line: 42, type: !385, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !379, line: 25, type: !392, isLocal: true, isDefinition: true)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!75, !47, !47, !47, !99}
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "bpf_xdp_adjust_head", scope: !2, file: !379, line: 92, type: !397, isLocal: true, isDefinition: true)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!75, !47, !75}
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 32, elements: !137)
!401 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!402 = !{i32 7, !"Dwarf Version", i32 5}
!403 = !{i32 2, !"Debug Info Version", i32 3}
!404 = !{i32 1, !"wchar_size", i32 4}
!405 = !{i32 7, !"PIC Level", i32 2}
!406 = !{i32 7, !"PIE Level", i32 2}
!407 = !{i32 7, !"uwtable", i32 1}
!408 = !{i32 7, !"frame-pointer", i32 2}
!409 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!410 = distinct !DISubprogram(name: "balancer_ingress", scope: !3, file: !3, line: 1022, type: !411, scopeLine: 1022, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !421)
!411 = !DISubroutineType(types: !412)
!412 = !{!75, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 3123, size: 160, elements: !415)
!415 = !{!416, !417, !418, !419, !420}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !414, file: !6, line: 3124, baseType: !52, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !414, file: !6, line: 3125, baseType: !52, size: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !414, file: !6, line: 3126, baseType: !52, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !414, file: !6, line: 3128, baseType: !52, size: 32, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !414, file: !6, line: 3129, baseType: !52, size: 32, offset: 128)
!421 = !{}
!422 = !DILocalVariable(name: "ctx", arg: 1, scope: !410, file: !3, line: 1022, type: !413)
!423 = !DILocation(line: 1022, column: 37, scope: !410)
!424 = !DILocalVariable(name: "data", scope: !410, file: !3, line: 1023, type: !47)
!425 = !DILocation(line: 1023, column: 9, scope: !410)
!426 = !DILocation(line: 1023, column: 29, scope: !410)
!427 = !DILocation(line: 1023, column: 34, scope: !410)
!428 = !DILocation(line: 1023, column: 23, scope: !410)
!429 = !DILocation(line: 1023, column: 16, scope: !410)
!430 = !DILocalVariable(name: "data_end", scope: !410, file: !3, line: 1024, type: !47)
!431 = !DILocation(line: 1024, column: 9, scope: !410)
!432 = !DILocation(line: 1024, column: 33, scope: !410)
!433 = !DILocation(line: 1024, column: 38, scope: !410)
!434 = !DILocation(line: 1024, column: 27, scope: !410)
!435 = !DILocation(line: 1024, column: 20, scope: !410)
!436 = !DILocalVariable(name: "eth", scope: !410, file: !3, line: 1025, type: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !439, line: 173, size: 112, elements: !440)
!439 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "163f54fb1af2e21fea410f14eb18fa76")
!440 = !{!441, !443, !444}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !438, file: !439, line: 174, baseType: !442, size: 48)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 48, elements: !103)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !438, file: !439, line: 175, baseType: !442, size: 48, offset: 48)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !438, file: !439, line: 176, baseType: !445, size: 16, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !134, line: 32, baseType: !49)
!446 = !DILocation(line: 1025, column: 18, scope: !410)
!447 = !DILocation(line: 1025, column: 24, scope: !410)
!448 = !DILocalVariable(name: "eth_proto", scope: !410, file: !3, line: 1026, type: !52)
!449 = !DILocation(line: 1026, column: 9, scope: !410)
!450 = !DILocalVariable(name: "nh_off", scope: !410, file: !3, line: 1027, type: !52)
!451 = !DILocation(line: 1027, column: 9, scope: !410)
!452 = !DILocation(line: 1028, column: 10, scope: !410)
!453 = !DILocation(line: 1030, column: 7, scope: !454)
!454 = distinct !DILexicalBlock(scope: !410, file: !3, line: 1030, column: 7)
!455 = !DILocation(line: 1030, column: 14, scope: !454)
!456 = !DILocation(line: 1030, column: 12, scope: !454)
!457 = !DILocation(line: 1030, column: 23, scope: !454)
!458 = !DILocation(line: 1030, column: 21, scope: !454)
!459 = !DILocation(line: 1030, column: 7, scope: !410)
!460 = !DILocation(line: 1032, column: 5, scope: !461)
!461 = distinct !DILexicalBlock(scope: !454, file: !3, line: 1030, column: 33)
!462 = !DILocation(line: 1035, column: 15, scope: !410)
!463 = !DILocation(line: 1035, column: 20, scope: !410)
!464 = !DILocation(line: 1035, column: 13, scope: !410)
!465 = !DILocation(line: 1037, column: 7, scope: !466)
!466 = distinct !DILexicalBlock(scope: !410, file: !3, line: 1037, column: 7)
!467 = !DILocation(line: 1037, column: 17, scope: !466)
!468 = !DILocation(line: 1037, column: 7, scope: !410)
!469 = !DILocation(line: 1038, column: 27, scope: !470)
!470 = distinct !DILexicalBlock(scope: !466, file: !3, line: 1037, column: 33)
!471 = !DILocation(line: 1038, column: 32, scope: !470)
!472 = !DILocalVariable(name: "xdp", arg: 1, scope: !473, file: !3, line: 642, type: !413)
!473 = distinct !DISubprogram(name: "process_packet", scope: !3, file: !3, line: 642, type: !474, scopeLine: 642, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !421)
!474 = !DISubroutineType(types: !475)
!475 = !{!75, !413, !98, !476}
!476 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!477 = !DILocation(line: 642, column: 31, scope: !473, inlinedAt: !478)
!478 = distinct !DILocation(line: 1038, column: 12, scope: !470)
!479 = !DILocalVariable(name: "off", arg: 2, scope: !473, file: !3, line: 642, type: !98)
!480 = !DILocation(line: 642, column: 42, scope: !473, inlinedAt: !478)
!481 = !DILocalVariable(name: "is_ipv6", arg: 3, scope: !473, file: !3, line: 642, type: !476)
!482 = !DILocation(line: 642, column: 52, scope: !473, inlinedAt: !478)
!483 = !DILocalVariable(name: "data", scope: !473, file: !3, line: 643, type: !47)
!484 = !DILocation(line: 643, column: 9, scope: !473, inlinedAt: !478)
!485 = !DILocation(line: 643, column: 29, scope: !473, inlinedAt: !478)
!486 = !DILocation(line: 643, column: 34, scope: !473, inlinedAt: !478)
!487 = !DILocation(line: 643, column: 23, scope: !473, inlinedAt: !478)
!488 = !DILocation(line: 643, column: 16, scope: !473, inlinedAt: !478)
!489 = !DILocalVariable(name: "data_end", scope: !473, file: !3, line: 644, type: !47)
!490 = !DILocation(line: 644, column: 9, scope: !473, inlinedAt: !478)
!491 = !DILocation(line: 644, column: 33, scope: !473, inlinedAt: !478)
!492 = !DILocation(line: 644, column: 38, scope: !473, inlinedAt: !478)
!493 = !DILocation(line: 644, column: 27, scope: !473, inlinedAt: !478)
!494 = !DILocation(line: 644, column: 20, scope: !473, inlinedAt: !478)
!495 = !DILocalVariable(name: "cval", scope: !473, file: !3, line: 645, type: !90)
!496 = !DILocation(line: 645, column: 21, scope: !473, inlinedAt: !478)
!497 = !DILocalVariable(name: "dst", scope: !473, file: !3, line: 646, type: !243)
!498 = !DILocation(line: 646, column: 27, scope: !473, inlinedAt: !478)
!499 = !DILocalVariable(name: "pckt", scope: !473, file: !3, line: 647, type: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_description", file: !92, line: 43, size: 384, elements: !501)
!501 = !{!502, !503, !504, !505}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !500, file: !92, line: 44, baseType: !164, size: 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "real_index", scope: !500, file: !92, line: 45, baseType: !52, size: 32, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !500, file: !92, line: 46, baseType: !59, size: 8, offset: 352)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !500, file: !92, line: 48, baseType: !59, size: 8, offset: 360)
!506 = !DILocation(line: 647, column: 29, scope: !473, inlinedAt: !478)
!507 = !DILocalVariable(name: "vip", scope: !473, file: !3, line: 648, type: !127)
!508 = !DILocation(line: 648, column: 25, scope: !473, inlinedAt: !478)
!509 = !DILocalVariable(name: "vip_info", scope: !473, file: !3, line: 649, type: !142)
!510 = !DILocation(line: 649, column: 20, scope: !473, inlinedAt: !478)
!511 = !DILocalVariable(name: "data_stats", scope: !473, file: !3, line: 650, type: !267)
!512 = !DILocation(line: 650, column: 20, scope: !473, inlinedAt: !478)
!513 = !DILocalVariable(name: "iph_len", scope: !473, file: !3, line: 651, type: !98)
!514 = !DILocation(line: 651, column: 9, scope: !473, inlinedAt: !478)
!515 = !DILocalVariable(name: "protocol", scope: !473, file: !3, line: 652, type: !59)
!516 = !DILocation(line: 652, column: 8, scope: !473, inlinedAt: !478)
!517 = !DILocalVariable(name: "original_sport", scope: !473, file: !3, line: 653, type: !49)
!518 = !DILocation(line: 653, column: 9, scope: !473, inlinedAt: !478)
!519 = !DILocalVariable(name: "action", scope: !473, file: !3, line: 655, type: !75)
!520 = !DILocation(line: 655, column: 7, scope: !473, inlinedAt: !478)
!521 = !DILocalVariable(name: "vip_num", scope: !473, file: !3, line: 656, type: !52)
!522 = !DILocation(line: 656, column: 9, scope: !473, inlinedAt: !478)
!523 = !DILocalVariable(name: "mac_addr_pos", scope: !473, file: !3, line: 657, type: !52)
!524 = !DILocation(line: 657, column: 9, scope: !473, inlinedAt: !478)
!525 = !DILocalVariable(name: "pkt_bytes", scope: !473, file: !3, line: 658, type: !49)
!526 = !DILocation(line: 658, column: 9, scope: !473, inlinedAt: !478)
!527 = !DILocation(line: 660, column: 25, scope: !473, inlinedAt: !478)
!528 = !DILocation(line: 660, column: 42, scope: !473, inlinedAt: !478)
!529 = !DILocation(line: 660, column: 48, scope: !473, inlinedAt: !478)
!530 = !DILocation(line: 660, column: 58, scope: !473, inlinedAt: !478)
!531 = !DILocalVariable(name: "pckt", arg: 1, scope: !532, file: !3, line: 201, type: !535)
!532 = distinct !DISubprogram(name: "process_l3_headers", scope: !3, file: !3, line: 200, type: !533, scopeLine: 207, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !421)
!533 = !DISubroutineType(types: !534)
!534 = !{!75, !535, !536, !98, !53, !47, !47, !476}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!537 = !DILocation(line: 201, column: 32, scope: !532, inlinedAt: !538)
!538 = distinct !DILocation(line: 659, column: 12, scope: !473, inlinedAt: !478)
!539 = !DILocalVariable(name: "protocol", arg: 2, scope: !532, file: !3, line: 202, type: !536)
!540 = !DILocation(line: 202, column: 11, scope: !532, inlinedAt: !538)
!541 = !DILocalVariable(name: "off", arg: 3, scope: !532, file: !3, line: 203, type: !98)
!542 = !DILocation(line: 203, column: 11, scope: !532, inlinedAt: !538)
!543 = !DILocalVariable(name: "pkt_bytes", arg: 4, scope: !532, file: !3, line: 204, type: !53)
!544 = !DILocation(line: 204, column: 12, scope: !532, inlinedAt: !538)
!545 = !DILocalVariable(name: "data", arg: 5, scope: !532, file: !3, line: 205, type: !47)
!546 = !DILocation(line: 205, column: 11, scope: !532, inlinedAt: !538)
!547 = !DILocalVariable(name: "data_end", arg: 6, scope: !532, file: !3, line: 206, type: !47)
!548 = !DILocation(line: 206, column: 11, scope: !532, inlinedAt: !538)
!549 = !DILocalVariable(name: "is_ipv6", arg: 7, scope: !532, file: !3, line: 207, type: !476)
!550 = !DILocation(line: 207, column: 10, scope: !532, inlinedAt: !538)
!551 = !DILocalVariable(name: "iph_len", scope: !532, file: !3, line: 208, type: !98)
!552 = !DILocation(line: 208, column: 9, scope: !532, inlinedAt: !538)
!553 = !DILocalVariable(name: "action", scope: !532, file: !3, line: 209, type: !75)
!554 = !DILocation(line: 209, column: 7, scope: !532, inlinedAt: !538)
!555 = !DILocalVariable(name: "iph", scope: !532, file: !3, line: 210, type: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !558, line: 87, size: 160, elements: !559)
!558 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "149778ace30a1ff208adc8783fd04b29")
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567, !568, !570}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !557, file: !558, line: 89, baseType: !59, size: 4, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !557, file: !558, line: 90, baseType: !59, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !557, file: !558, line: 97, baseType: !59, size: 8, offset: 8)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !557, file: !558, line: 98, baseType: !445, size: 16, offset: 16)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !557, file: !558, line: 99, baseType: !445, size: 16, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !557, file: !558, line: 100, baseType: !445, size: 16, offset: 48)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !557, file: !558, line: 101, baseType: !59, size: 8, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !557, file: !558, line: 102, baseType: !59, size: 8, offset: 72)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !557, file: !558, line: 103, baseType: !569, size: 16, offset: 80)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !134, line: 38, baseType: !49)
!570 = !DIDerivedType(tag: DW_TAG_member, scope: !557, file: !558, line: 104, baseType: !571, size: 64, offset: 96)
!571 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !557, file: !558, line: 104, size: 64, elements: !572)
!572 = !{!573, !578}
!573 = !DIDerivedType(tag: DW_TAG_member, scope: !571, file: !558, line: 104, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !571, file: !558, line: 104, size: 64, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !574, file: !558, line: 104, baseType: !133, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !574, file: !558, line: 104, baseType: !133, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !571, file: !558, line: 104, baseType: !579, size: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !571, file: !558, line: 104, size: 64, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !579, file: !558, line: 104, baseType: !133, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !579, file: !558, line: 104, baseType: !133, size: 32, offset: 32)
!583 = !DILocation(line: 210, column: 17, scope: !532, inlinedAt: !538)
!584 = !DILocalVariable(name: "ip6h", scope: !532, file: !3, line: 211, type: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !587, line: 118, size: 320, elements: !588)
!587 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "d288e308e142e51c48e7422f4fbbaa3f")
!588 = !{!589, !590, !591, !595, !596, !597, !598}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !586, file: !587, line: 120, baseType: !59, size: 4, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !586, file: !587, line: 121, baseType: !59, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !586, file: !587, line: 128, baseType: !592, size: 24, offset: 8)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 24, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 3)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !586, file: !587, line: 130, baseType: !445, size: 16, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !586, file: !587, line: 131, baseType: !59, size: 8, offset: 48)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !586, file: !587, line: 132, baseType: !59, size: 8, offset: 56)
!598 = !DIDerivedType(tag: DW_TAG_member, scope: !586, file: !587, line: 134, baseType: !599, size: 256, offset: 64)
!599 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !586, file: !587, line: 134, size: 256, elements: !600)
!600 = !{!601, !617}
!601 = !DIDerivedType(tag: DW_TAG_member, scope: !599, file: !587, line: 134, baseType: !602, size: 256)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !599, file: !587, line: 134, size: 256, elements: !603)
!603 = !{!604, !616}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !602, file: !587, line: 134, baseType: !605, size: 128)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !606, line: 33, size: 128, elements: !607)
!606 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "fca1889f0274df066e49cf4d8db8011e")
!607 = !{!608}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !605, file: !606, line: 40, baseType: !609, size: 128)
!609 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !605, file: !606, line: 34, size: 128, elements: !610)
!610 = !{!611, !613, !615}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !609, file: !606, line: 35, baseType: !612, size: 128)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 128, elements: !108)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !609, file: !606, line: 37, baseType: !614, size: 128)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 128, elements: !65)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !609, file: !606, line: 38, baseType: !136, size: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !602, file: !587, line: 134, baseType: !605, size: 128, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !599, file: !587, line: 134, baseType: !618, size: 256)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !599, file: !587, line: 134, size: 256, elements: !619)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !618, file: !587, line: 134, baseType: !605, size: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !618, file: !587, line: 134, baseType: !605, size: 128, offset: 128)
!622 = !DILocation(line: 211, column: 19, scope: !532, inlinedAt: !538)
!623 = !DILocation(line: 212, column: 7, scope: !624, inlinedAt: !538)
!624 = distinct !DILexicalBlock(scope: !532, file: !3, line: 212, column: 7)
!625 = !DILocation(line: 212, column: 7, scope: !532, inlinedAt: !538)
!626 = !DILocation(line: 213, column: 12, scope: !627, inlinedAt: !538)
!627 = distinct !DILexicalBlock(scope: !624, file: !3, line: 212, column: 16)
!628 = !DILocation(line: 213, column: 19, scope: !627, inlinedAt: !538)
!629 = !DILocation(line: 213, column: 17, scope: !627, inlinedAt: !538)
!630 = !DILocation(line: 213, column: 10, scope: !627, inlinedAt: !538)
!631 = !DILocation(line: 214, column: 9, scope: !632, inlinedAt: !538)
!632 = distinct !DILexicalBlock(scope: !627, file: !3, line: 214, column: 9)
!633 = !DILocation(line: 214, column: 14, scope: !632, inlinedAt: !538)
!634 = !DILocation(line: 214, column: 20, scope: !632, inlinedAt: !538)
!635 = !DILocation(line: 214, column: 18, scope: !632, inlinedAt: !538)
!636 = !DILocation(line: 214, column: 9, scope: !627, inlinedAt: !538)
!637 = !DILocation(line: 215, column: 7, scope: !638, inlinedAt: !538)
!638 = distinct !DILexicalBlock(scope: !632, file: !3, line: 214, column: 30)
!639 = !DILocation(line: 218, column: 13, scope: !627, inlinedAt: !538)
!640 = !DILocation(line: 219, column: 17, scope: !627, inlinedAt: !538)
!641 = !DILocation(line: 219, column: 23, scope: !627, inlinedAt: !538)
!642 = !DILocation(line: 219, column: 6, scope: !627, inlinedAt: !538)
!643 = !DILocation(line: 219, column: 15, scope: !627, inlinedAt: !538)
!644 = !DILocation(line: 220, column: 25, scope: !627, inlinedAt: !538)
!645 = !DILocation(line: 220, column: 24, scope: !627, inlinedAt: !538)
!646 = !DILocation(line: 220, column: 5, scope: !627, inlinedAt: !538)
!647 = !DILocation(line: 220, column: 11, scope: !627, inlinedAt: !538)
!648 = !DILocation(line: 220, column: 16, scope: !627, inlinedAt: !538)
!649 = !DILocation(line: 220, column: 22, scope: !627, inlinedAt: !538)
!650 = !DILocation(line: 223, column: 18, scope: !627, inlinedAt: !538)
!651 = !DILocation(line: 223, column: 24, scope: !627, inlinedAt: !538)
!652 = !DILocation(line: 223, column: 33, scope: !627, inlinedAt: !538)
!653 = !DILocation(line: 223, column: 39, scope: !627, inlinedAt: !538)
!654 = !DILocation(line: 223, column: 17, scope: !627, inlinedAt: !538)
!655 = !DILocation(line: 223, column: 5, scope: !627, inlinedAt: !538)
!656 = !DILocation(line: 223, column: 11, scope: !627, inlinedAt: !538)
!657 = !DILocation(line: 223, column: 15, scope: !627, inlinedAt: !538)
!658 = !DILocation(line: 224, column: 17, scope: !627, inlinedAt: !538)
!659 = !DILocation(line: 224, column: 23, scope: !627, inlinedAt: !538)
!660 = !DILocation(line: 224, column: 31, scope: !627, inlinedAt: !538)
!661 = !DILocation(line: 224, column: 37, scope: !627, inlinedAt: !538)
!662 = !DILocation(line: 224, column: 49, scope: !627, inlinedAt: !538)
!663 = !DILocation(line: 224, column: 55, scope: !627, inlinedAt: !538)
!664 = !DILocation(line: 224, column: 27, scope: !627, inlinedAt: !538)
!665 = !DILocation(line: 224, column: 5, scope: !627, inlinedAt: !538)
!666 = !DILocation(line: 224, column: 11, scope: !627, inlinedAt: !538)
!667 = !DILocation(line: 224, column: 15, scope: !627, inlinedAt: !538)
!668 = !DILocation(line: 226, column: 18, scope: !627, inlinedAt: !538)
!669 = !DILocation(line: 226, column: 6, scope: !627, inlinedAt: !538)
!670 = !DILocation(line: 226, column: 16, scope: !627, inlinedAt: !538)
!671 = !DILocation(line: 227, column: 12, scope: !627, inlinedAt: !538)
!672 = !DILocation(line: 227, column: 9, scope: !627, inlinedAt: !538)
!673 = !DILocation(line: 228, column: 10, scope: !674, inlinedAt: !538)
!674 = distinct !DILexicalBlock(scope: !627, file: !3, line: 228, column: 9)
!675 = !DILocation(line: 228, column: 9, scope: !674, inlinedAt: !538)
!676 = !DILocation(line: 228, column: 19, scope: !674, inlinedAt: !538)
!677 = !DILocation(line: 228, column: 9, scope: !627, inlinedAt: !538)
!678 = !DILocation(line: 230, column: 7, scope: !679, inlinedAt: !538)
!679 = distinct !DILexicalBlock(scope: !674, file: !3, line: 228, column: 40)
!680 = !DILocation(line: 231, column: 17, scope: !681, inlinedAt: !538)
!681 = distinct !DILexicalBlock(scope: !674, file: !3, line: 231, column: 16)
!682 = !DILocation(line: 231, column: 16, scope: !681, inlinedAt: !538)
!683 = !DILocation(line: 231, column: 26, scope: !681, inlinedAt: !538)
!684 = !DILocation(line: 231, column: 16, scope: !674, inlinedAt: !538)
!685 = !DILocation(line: 232, column: 29, scope: !686, inlinedAt: !538)
!686 = distinct !DILexicalBlock(scope: !681, file: !3, line: 231, column: 45)
!687 = !DILocation(line: 232, column: 35, scope: !686, inlinedAt: !538)
!688 = !DILocation(line: 232, column: 45, scope: !686, inlinedAt: !538)
!689 = !DILocation(line: 232, column: 50, scope: !686, inlinedAt: !538)
!690 = !DILocalVariable(name: "data", arg: 1, scope: !691, file: !692, line: 229, type: !47)
!691 = distinct !DISubprogram(name: "parse_icmpv6", scope: !692, file: !692, line: 228, type: !693, scopeLine: 232, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !421)
!692 = !DIFile(filename: "lib/bpf/../bpf/handle_icmp.h", directory: "/home/yunwei/ebpf-xdp-dpdk/katran", checksumkind: CSK_MD5, checksum: "3a3f8e69bda4b930af6d8bb9f7569055")
!693 = !DISubroutineType(types: !694)
!694 = !{!75, !47, !47, !98, !535}
!695 = !DILocation(line: 229, column: 11, scope: !691, inlinedAt: !696)
!696 = distinct !DILocation(line: 232, column: 16, scope: !686, inlinedAt: !538)
!697 = !DILocalVariable(name: "data_end", arg: 2, scope: !691, file: !692, line: 230, type: !47)
!698 = !DILocation(line: 230, column: 11, scope: !691, inlinedAt: !696)
!699 = !DILocalVariable(name: "off", arg: 3, scope: !691, file: !692, line: 231, type: !98)
!700 = !DILocation(line: 231, column: 11, scope: !691, inlinedAt: !696)
!701 = !DILocalVariable(name: "pckt", arg: 4, scope: !691, file: !692, line: 232, type: !535)
!702 = !DILocation(line: 232, column: 32, scope: !691, inlinedAt: !696)
!703 = !DILocalVariable(name: "icmp_hdr", scope: !691, file: !692, line: 233, type: !704)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp6hdr", file: !706, line: 8, size: 64, elements: !707)
!706 = !DIFile(filename: "/usr/include/linux/icmpv6.h", directory: "", checksumkind: CSK_MD5, checksum: "0310ca5584e6f44f6eea6cf040ee84b9")
!707 = !{!708, !709, !710, !711}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_type", scope: !705, file: !706, line: 10, baseType: !59, size: 8)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_code", scope: !705, file: !706, line: 11, baseType: !59, size: 8, offset: 8)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_cksum", scope: !705, file: !706, line: 12, baseType: !569, size: 16, offset: 16)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_dataun", scope: !705, file: !706, line: 63, baseType: !712, size: 32, offset: 32)
!712 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !705, file: !706, line: 15, size: 32, elements: !713)
!713 = !{!714, !716, !718, !720, !725, !733}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "un_data32", scope: !712, file: !706, line: 16, baseType: !715, size: 32)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 32, elements: !123)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "un_data16", scope: !712, file: !706, line: 17, baseType: !717, size: 32)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 32, elements: !85)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "un_data8", scope: !712, file: !706, line: 18, baseType: !719, size: 32)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 32, elements: !137)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "u_echo", scope: !712, file: !706, line: 23, baseType: !721, size: 32)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_echo", file: !706, line: 20, size: 32, elements: !722)
!722 = !{!723, !724}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !721, file: !706, line: 21, baseType: !445, size: 16)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !721, file: !706, line: 22, baseType: !445, size: 16, offset: 16)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_advt", scope: !712, file: !706, line: 40, baseType: !726, size: 32)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_advt", file: !706, line: 25, size: 32, elements: !727)
!727 = !{!728, !729, !730, !731, !732}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !726, file: !706, line: 27, baseType: !52, size: 5, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !726, file: !706, line: 28, baseType: !52, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "solicited", scope: !726, file: !706, line: 29, baseType: !52, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "router", scope: !726, file: !706, line: 30, baseType: !52, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !726, file: !706, line: 31, baseType: !52, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_ra", scope: !712, file: !706, line: 61, baseType: !734, size: 32)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_ra", file: !706, line: 42, size: 32, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !734, file: !706, line: 43, baseType: !59, size: 8)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !734, file: !706, line: 45, baseType: !59, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "router_pref", scope: !734, file: !706, line: 46, baseType: !59, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "home_agent", scope: !734, file: !706, line: 47, baseType: !59, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 8)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !734, file: !706, line: 48, baseType: !59, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 8)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "managed", scope: !734, file: !706, line: 49, baseType: !59, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 8)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "rt_lifetime", scope: !734, file: !706, line: 60, baseType: !445, size: 16, offset: 16)
!743 = !DILocation(line: 233, column: 20, scope: !691, inlinedAt: !696)
!744 = !DILocalVariable(name: "ip6h", scope: !691, file: !692, line: 234, type: !585)
!745 = !DILocation(line: 234, column: 19, scope: !691, inlinedAt: !696)
!746 = !DILocation(line: 235, column: 14, scope: !691, inlinedAt: !696)
!747 = !DILocation(line: 235, column: 21, scope: !691, inlinedAt: !696)
!748 = !DILocation(line: 235, column: 19, scope: !691, inlinedAt: !696)
!749 = !DILocation(line: 235, column: 12, scope: !691, inlinedAt: !696)
!750 = !DILocation(line: 236, column: 7, scope: !751, inlinedAt: !696)
!751 = distinct !DILexicalBlock(scope: !691, file: !692, line: 236, column: 7)
!752 = !DILocation(line: 236, column: 16, scope: !751, inlinedAt: !696)
!753 = !DILocation(line: 236, column: 22, scope: !751, inlinedAt: !696)
!754 = !DILocation(line: 236, column: 20, scope: !751, inlinedAt: !696)
!755 = !DILocation(line: 236, column: 7, scope: !691, inlinedAt: !696)
!756 = !DILocation(line: 237, column: 5, scope: !757, inlinedAt: !696)
!757 = distinct !DILexicalBlock(scope: !751, file: !692, line: 236, column: 32)
!758 = !DILocation(line: 239, column: 7, scope: !759, inlinedAt: !696)
!759 = distinct !DILexicalBlock(scope: !691, file: !692, line: 239, column: 7)
!760 = !DILocation(line: 239, column: 17, scope: !759, inlinedAt: !696)
!761 = !DILocation(line: 239, column: 28, scope: !759, inlinedAt: !696)
!762 = !DILocation(line: 239, column: 7, scope: !691, inlinedAt: !696)
!763 = !DILocation(line: 240, column: 29, scope: !764, inlinedAt: !696)
!764 = distinct !DILexicalBlock(scope: !759, file: !692, line: 239, column: 52)
!765 = !DILocation(line: 240, column: 35, scope: !764, inlinedAt: !696)
!766 = !DILocalVariable(name: "data", arg: 1, scope: !767, file: !692, line: 95, type: !47)
!767 = distinct !DISubprogram(name: "send_icmp6_reply", scope: !692, file: !692, line: 94, type: !768, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !421)
!768 = !DISubroutineType(types: !769)
!769 = !{!75, !47, !47}
!770 = !DILocation(line: 95, column: 11, scope: !767, inlinedAt: !771)
!771 = distinct !DILocation(line: 240, column: 12, scope: !764, inlinedAt: !696)
!772 = !DILocalVariable(name: "data_end", arg: 2, scope: !767, file: !692, line: 96, type: !47)
!773 = !DILocation(line: 96, column: 11, scope: !767, inlinedAt: !771)
!774 = !DILocalVariable(name: "ip6h", scope: !767, file: !692, line: 97, type: !585)
!775 = !DILocation(line: 97, column: 19, scope: !767, inlinedAt: !771)
!776 = !DILocalVariable(name: "icmp_hdr", scope: !767, file: !692, line: 98, type: !704)
!777 = !DILocation(line: 98, column: 20, scope: !767, inlinedAt: !771)
!778 = !DILocalVariable(name: "tmp_addr", scope: !767, file: !692, line: 99, type: !136)
!779 = !DILocation(line: 99, column: 10, scope: !767, inlinedAt: !771)
!780 = !DILocalVariable(name: "off", scope: !767, file: !692, line: 100, type: !98)
!781 = !DILocation(line: 100, column: 9, scope: !767, inlinedAt: !771)
!782 = !DILocation(line: 101, column: 8, scope: !783, inlinedAt: !771)
!783 = distinct !DILexicalBlock(scope: !767, file: !692, line: 101, column: 7)
!784 = !DILocation(line: 101, column: 13, scope: !783, inlinedAt: !771)
!785 = !DILocation(line: 101, column: 37, scope: !783, inlinedAt: !771)
!786 = !DILocation(line: 101, column: 62, scope: !783, inlinedAt: !771)
!787 = !DILocation(line: 102, column: 35, scope: !783, inlinedAt: !771)
!788 = !DILocation(line: 102, column: 33, scope: !783, inlinedAt: !771)
!789 = !DILocation(line: 101, column: 7, scope: !767, inlinedAt: !771)
!790 = !DILocation(line: 103, column: 5, scope: !791, inlinedAt: !771)
!791 = distinct !DILexicalBlock(scope: !783, file: !692, line: 102, column: 45)
!792 = !DILocation(line: 105, column: 7, scope: !767, inlinedAt: !771)
!793 = !DILocation(line: 106, column: 10, scope: !767, inlinedAt: !771)
!794 = !DILocation(line: 106, column: 17, scope: !767, inlinedAt: !771)
!795 = !DILocation(line: 106, column: 15, scope: !767, inlinedAt: !771)
!796 = !DILocation(line: 106, column: 8, scope: !767, inlinedAt: !771)
!797 = !DILocation(line: 107, column: 7, scope: !767, inlinedAt: !771)
!798 = !DILocation(line: 108, column: 14, scope: !767, inlinedAt: !771)
!799 = !DILocation(line: 108, column: 21, scope: !767, inlinedAt: !771)
!800 = !DILocation(line: 108, column: 19, scope: !767, inlinedAt: !771)
!801 = !DILocation(line: 108, column: 12, scope: !767, inlinedAt: !771)
!802 = !DILocation(line: 109, column: 3, scope: !767, inlinedAt: !771)
!803 = !DILocation(line: 109, column: 13, scope: !767, inlinedAt: !771)
!804 = !DILocation(line: 109, column: 24, scope: !767, inlinedAt: !771)
!805 = !DILocation(line: 113, column: 3, scope: !767, inlinedAt: !771)
!806 = !DILocation(line: 113, column: 13, scope: !767, inlinedAt: !771)
!807 = !DILocation(line: 113, column: 25, scope: !767, inlinedAt: !771)
!808 = !DILocation(line: 114, column: 3, scope: !767, inlinedAt: !771)
!809 = !DILocation(line: 114, column: 9, scope: !767, inlinedAt: !771)
!810 = !DILocation(line: 114, column: 19, scope: !767, inlinedAt: !771)
!811 = !DILocation(line: 115, column: 3, scope: !767, inlinedAt: !771)
!812 = !DILocation(line: 115, column: 20, scope: !767, inlinedAt: !771)
!813 = !DILocation(line: 115, column: 26, scope: !767, inlinedAt: !771)
!814 = !DILocation(line: 115, column: 32, scope: !767, inlinedAt: !771)
!815 = !DILocation(line: 116, column: 10, scope: !767, inlinedAt: !771)
!816 = !DILocation(line: 116, column: 16, scope: !767, inlinedAt: !771)
!817 = !DILocation(line: 116, column: 22, scope: !767, inlinedAt: !771)
!818 = !DILocation(line: 116, column: 3, scope: !767, inlinedAt: !771)
!819 = !DILocation(line: 116, column: 33, scope: !767, inlinedAt: !771)
!820 = !DILocation(line: 116, column: 39, scope: !767, inlinedAt: !771)
!821 = !DILocation(line: 116, column: 45, scope: !767, inlinedAt: !771)
!822 = !DILocation(line: 117, column: 10, scope: !767, inlinedAt: !771)
!823 = !DILocation(line: 117, column: 16, scope: !767, inlinedAt: !771)
!824 = !DILocation(line: 117, column: 22, scope: !767, inlinedAt: !771)
!825 = !DILocation(line: 117, column: 3, scope: !767, inlinedAt: !771)
!826 = !DILocation(line: 118, column: 28, scope: !767, inlinedAt: !771)
!827 = !DILocation(line: 118, column: 34, scope: !767, inlinedAt: !771)
!828 = !DILocalVariable(name: "data", arg: 1, scope: !829, file: !692, line: 41, type: !47)
!829 = distinct !DISubprogram(name: "swap_mac_and_send", scope: !692, file: !692, line: 40, type: !768, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !421)
!830 = !DILocation(line: 41, column: 11, scope: !829, inlinedAt: !831)
!831 = distinct !DILocation(line: 118, column: 10, scope: !767, inlinedAt: !771)
!832 = !DILocalVariable(name: "data_end", arg: 2, scope: !829, file: !692, line: 42, type: !47)
!833 = !DILocation(line: 42, column: 11, scope: !829, inlinedAt: !831)
!834 = !DILocalVariable(name: "eth", scope: !829, file: !692, line: 43, type: !437)
!835 = !DILocation(line: 43, column: 18, scope: !829, inlinedAt: !831)
!836 = !DILocalVariable(name: "tmp_mac", scope: !829, file: !692, line: 44, type: !442)
!837 = !DILocation(line: 44, column: 17, scope: !829, inlinedAt: !831)
!838 = !DILocation(line: 45, column: 9, scope: !829, inlinedAt: !831)
!839 = !DILocation(line: 45, column: 7, scope: !829, inlinedAt: !831)
!840 = !DILocation(line: 46, column: 3, scope: !829, inlinedAt: !831)
!841 = !DILocation(line: 46, column: 19, scope: !829, inlinedAt: !831)
!842 = !DILocation(line: 46, column: 24, scope: !829, inlinedAt: !831)
!843 = !DILocation(line: 47, column: 10, scope: !829, inlinedAt: !831)
!844 = !DILocation(line: 47, column: 15, scope: !829, inlinedAt: !831)
!845 = !DILocation(line: 47, column: 3, scope: !829, inlinedAt: !831)
!846 = !DILocation(line: 47, column: 25, scope: !829, inlinedAt: !831)
!847 = !DILocation(line: 47, column: 30, scope: !829, inlinedAt: !831)
!848 = !DILocation(line: 48, column: 10, scope: !829, inlinedAt: !831)
!849 = !DILocation(line: 48, column: 15, scope: !829, inlinedAt: !831)
!850 = !DILocation(line: 48, column: 3, scope: !829, inlinedAt: !831)
!851 = !DILocation(line: 118, column: 3, scope: !767, inlinedAt: !771)
!852 = !DILocation(line: 119, column: 1, scope: !767, inlinedAt: !771)
!853 = !DILocation(line: 240, column: 5, scope: !764, inlinedAt: !696)
!854 = !DILocation(line: 242, column: 8, scope: !855, inlinedAt: !696)
!855 = distinct !DILexicalBlock(scope: !691, file: !692, line: 242, column: 7)
!856 = !DILocation(line: 242, column: 18, scope: !855, inlinedAt: !696)
!857 = !DILocation(line: 242, column: 29, scope: !855, inlinedAt: !696)
!858 = !DILocation(line: 242, column: 51, scope: !855, inlinedAt: !696)
!859 = !DILocation(line: 243, column: 8, scope: !855, inlinedAt: !696)
!860 = !DILocation(line: 243, column: 18, scope: !855, inlinedAt: !696)
!861 = !DILocation(line: 243, column: 29, scope: !855, inlinedAt: !696)
!862 = !DILocation(line: 242, column: 7, scope: !691, inlinedAt: !696)
!863 = !DILocation(line: 244, column: 5, scope: !864, inlinedAt: !696)
!864 = distinct !DILexicalBlock(scope: !855, file: !692, line: 243, column: 54)
!865 = !DILocation(line: 247, column: 7, scope: !866, inlinedAt: !696)
!866 = distinct !DILexicalBlock(scope: !691, file: !692, line: 247, column: 7)
!867 = !DILocation(line: 247, column: 17, scope: !866, inlinedAt: !696)
!868 = !DILocation(line: 247, column: 28, scope: !866, inlinedAt: !696)
!869 = !DILocation(line: 247, column: 7, scope: !691, inlinedAt: !696)
!870 = !DILocalVariable(name: "stats_key", scope: !871, file: !692, line: 248, type: !52)
!871 = distinct !DILexicalBlock(scope: !866, file: !692, line: 247, column: 50)
!872 = !DILocation(line: 248, column: 11, scope: !871, inlinedAt: !696)
!873 = !DILocalVariable(name: "icmp_ptb_v6_stats", scope: !871, file: !692, line: 249, type: !267)
!874 = !DILocation(line: 249, column: 22, scope: !871, inlinedAt: !696)
!875 = !DILocation(line: 250, column: 9, scope: !871, inlinedAt: !696)
!876 = !DILocation(line: 250, column: 37, scope: !871, inlinedAt: !696)
!877 = !DILocation(line: 251, column: 10, scope: !878, inlinedAt: !696)
!878 = distinct !DILexicalBlock(scope: !871, file: !692, line: 251, column: 9)
!879 = !DILocation(line: 251, column: 9, scope: !871, inlinedAt: !696)
!880 = !DILocation(line: 252, column: 7, scope: !881, inlinedAt: !696)
!881 = distinct !DILexicalBlock(scope: !878, file: !692, line: 251, column: 29)
!882 = !DILocation(line: 254, column: 5, scope: !871, inlinedAt: !696)
!883 = !DILocation(line: 254, column: 24, scope: !871, inlinedAt: !696)
!884 = !DILocation(line: 254, column: 27, scope: !871, inlinedAt: !696)
!885 = !DILocalVariable(name: "mtu", scope: !871, file: !692, line: 255, type: !52)
!886 = !DILocation(line: 255, column: 11, scope: !871, inlinedAt: !696)
!887 = !DILocation(line: 255, column: 17, scope: !871, inlinedAt: !696)
!888 = !DILocation(line: 256, column: 9, scope: !889, inlinedAt: !696)
!889 = distinct !DILexicalBlock(scope: !871, file: !692, line: 256, column: 9)
!890 = !DILocation(line: 256, column: 13, scope: !889, inlinedAt: !696)
!891 = !DILocation(line: 256, column: 9, scope: !871, inlinedAt: !696)
!892 = !DILocation(line: 257, column: 7, scope: !893, inlinedAt: !696)
!893 = distinct !DILexicalBlock(scope: !889, file: !692, line: 256, column: 39)
!894 = !DILocation(line: 257, column: 26, scope: !893, inlinedAt: !696)
!895 = !DILocation(line: 257, column: 29, scope: !893, inlinedAt: !696)
!896 = !DILocation(line: 258, column: 5, scope: !893, inlinedAt: !696)
!897 = !DILocation(line: 259, column: 3, scope: !871, inlinedAt: !696)
!898 = !DILocation(line: 261, column: 7, scope: !691, inlinedAt: !696)
!899 = !DILocation(line: 264, column: 10, scope: !691, inlinedAt: !696)
!900 = !DILocation(line: 264, column: 17, scope: !691, inlinedAt: !696)
!901 = !DILocation(line: 264, column: 15, scope: !691, inlinedAt: !696)
!902 = !DILocation(line: 264, column: 8, scope: !691, inlinedAt: !696)
!903 = !DILocation(line: 265, column: 7, scope: !904, inlinedAt: !696)
!904 = distinct !DILexicalBlock(scope: !691, file: !692, line: 265, column: 7)
!905 = !DILocation(line: 265, column: 12, scope: !904, inlinedAt: !696)
!906 = !DILocation(line: 265, column: 18, scope: !904, inlinedAt: !696)
!907 = !DILocation(line: 265, column: 16, scope: !904, inlinedAt: !696)
!908 = !DILocation(line: 265, column: 7, scope: !691, inlinedAt: !696)
!909 = !DILocation(line: 266, column: 5, scope: !910, inlinedAt: !696)
!910 = distinct !DILexicalBlock(scope: !904, file: !692, line: 265, column: 28)
!911 = !DILocation(line: 268, column: 22, scope: !691, inlinedAt: !696)
!912 = !DILocation(line: 268, column: 28, scope: !691, inlinedAt: !696)
!913 = !DILocation(line: 268, column: 3, scope: !691, inlinedAt: !696)
!914 = !DILocation(line: 268, column: 9, scope: !691, inlinedAt: !696)
!915 = !DILocation(line: 268, column: 14, scope: !691, inlinedAt: !696)
!916 = !DILocation(line: 268, column: 20, scope: !691, inlinedAt: !696)
!917 = !DILocation(line: 269, column: 3, scope: !691, inlinedAt: !696)
!918 = !DILocation(line: 269, column: 9, scope: !691, inlinedAt: !696)
!919 = !DILocation(line: 269, column: 15, scope: !691, inlinedAt: !696)
!920 = !DILocation(line: 270, column: 10, scope: !691, inlinedAt: !696)
!921 = !DILocation(line: 270, column: 16, scope: !691, inlinedAt: !696)
!922 = !DILocation(line: 270, column: 21, scope: !691, inlinedAt: !696)
!923 = !DILocation(line: 270, column: 3, scope: !691, inlinedAt: !696)
!924 = !DILocation(line: 270, column: 28, scope: !691, inlinedAt: !696)
!925 = !DILocation(line: 270, column: 34, scope: !691, inlinedAt: !696)
!926 = !DILocation(line: 270, column: 40, scope: !691, inlinedAt: !696)
!927 = !DILocation(line: 271, column: 10, scope: !691, inlinedAt: !696)
!928 = !DILocation(line: 271, column: 16, scope: !691, inlinedAt: !696)
!929 = !DILocation(line: 271, column: 21, scope: !691, inlinedAt: !696)
!930 = !DILocation(line: 271, column: 3, scope: !691, inlinedAt: !696)
!931 = !DILocation(line: 271, column: 28, scope: !691, inlinedAt: !696)
!932 = !DILocation(line: 271, column: 34, scope: !691, inlinedAt: !696)
!933 = !DILocation(line: 271, column: 40, scope: !691, inlinedAt: !696)
!934 = !DILocation(line: 272, column: 3, scope: !691, inlinedAt: !696)
!935 = !DILocation(line: 273, column: 1, scope: !691, inlinedAt: !696)
!936 = !DILocation(line: 232, column: 14, scope: !686, inlinedAt: !538)
!937 = !DILocation(line: 233, column: 11, scope: !938, inlinedAt: !538)
!938 = distinct !DILexicalBlock(scope: !686, file: !3, line: 233, column: 11)
!939 = !DILocation(line: 233, column: 18, scope: !938, inlinedAt: !538)
!940 = !DILocation(line: 233, column: 11, scope: !686, inlinedAt: !538)
!941 = !DILocation(line: 234, column: 16, scope: !942, inlinedAt: !538)
!942 = distinct !DILexicalBlock(scope: !938, file: !3, line: 233, column: 24)
!943 = !DILocation(line: 234, column: 9, scope: !942, inlinedAt: !538)
!944 = !DILocation(line: 236, column: 5, scope: !686, inlinedAt: !538)
!945 = !DILocation(line: 237, column: 14, scope: !946, inlinedAt: !538)
!946 = distinct !DILexicalBlock(scope: !681, file: !3, line: 236, column: 12)
!947 = !DILocation(line: 237, column: 20, scope: !946, inlinedAt: !538)
!948 = !DILocation(line: 237, column: 25, scope: !946, inlinedAt: !538)
!949 = !DILocation(line: 237, column: 7, scope: !946, inlinedAt: !538)
!950 = !DILocation(line: 237, column: 32, scope: !946, inlinedAt: !538)
!951 = !DILocation(line: 237, column: 38, scope: !946, inlinedAt: !538)
!952 = !DILocation(line: 237, column: 44, scope: !946, inlinedAt: !538)
!953 = !DILocation(line: 238, column: 14, scope: !946, inlinedAt: !538)
!954 = !DILocation(line: 238, column: 20, scope: !946, inlinedAt: !538)
!955 = !DILocation(line: 238, column: 25, scope: !946, inlinedAt: !538)
!956 = !DILocation(line: 238, column: 7, scope: !946, inlinedAt: !538)
!957 = !DILocation(line: 238, column: 32, scope: !946, inlinedAt: !538)
!958 = !DILocation(line: 238, column: 38, scope: !946, inlinedAt: !538)
!959 = !DILocation(line: 238, column: 44, scope: !946, inlinedAt: !538)
!960 = !DILocation(line: 240, column: 3, scope: !627, inlinedAt: !538)
!961 = !DILocation(line: 241, column: 11, scope: !962, inlinedAt: !538)
!962 = distinct !DILexicalBlock(scope: !624, file: !3, line: 240, column: 10)
!963 = !DILocation(line: 241, column: 18, scope: !962, inlinedAt: !538)
!964 = !DILocation(line: 241, column: 16, scope: !962, inlinedAt: !538)
!965 = !DILocation(line: 241, column: 9, scope: !962, inlinedAt: !538)
!966 = !DILocation(line: 242, column: 9, scope: !967, inlinedAt: !538)
!967 = distinct !DILexicalBlock(scope: !962, file: !3, line: 242, column: 9)
!968 = !DILocation(line: 242, column: 13, scope: !967, inlinedAt: !538)
!969 = !DILocation(line: 242, column: 19, scope: !967, inlinedAt: !538)
!970 = !DILocation(line: 242, column: 17, scope: !967, inlinedAt: !538)
!971 = !DILocation(line: 242, column: 9, scope: !962, inlinedAt: !538)
!972 = !DILocation(line: 243, column: 7, scope: !973, inlinedAt: !538)
!973 = distinct !DILexicalBlock(scope: !967, file: !3, line: 242, column: 29)
!974 = !DILocation(line: 246, column: 9, scope: !975, inlinedAt: !538)
!975 = distinct !DILexicalBlock(scope: !962, file: !3, line: 246, column: 9)
!976 = !DILocation(line: 246, column: 14, scope: !975, inlinedAt: !538)
!977 = !DILocation(line: 246, column: 18, scope: !975, inlinedAt: !538)
!978 = !DILocation(line: 246, column: 9, scope: !962, inlinedAt: !538)
!979 = !DILocation(line: 249, column: 7, scope: !980, inlinedAt: !538)
!980 = distinct !DILexicalBlock(scope: !975, file: !3, line: 246, column: 24)
!981 = !DILocation(line: 251, column: 17, scope: !962, inlinedAt: !538)
!982 = !DILocation(line: 251, column: 22, scope: !962, inlinedAt: !538)
!983 = !DILocation(line: 251, column: 5, scope: !962, inlinedAt: !538)
!984 = !DILocation(line: 251, column: 11, scope: !962, inlinedAt: !538)
!985 = !DILocation(line: 251, column: 15, scope: !962, inlinedAt: !538)
!986 = !DILocation(line: 252, column: 17, scope: !962, inlinedAt: !538)
!987 = !DILocation(line: 252, column: 22, scope: !962, inlinedAt: !538)
!988 = !DILocation(line: 252, column: 6, scope: !962, inlinedAt: !538)
!989 = !DILocation(line: 252, column: 15, scope: !962, inlinedAt: !538)
!990 = !DILocation(line: 253, column: 25, scope: !962, inlinedAt: !538)
!991 = !DILocation(line: 253, column: 24, scope: !962, inlinedAt: !538)
!992 = !DILocation(line: 253, column: 5, scope: !962, inlinedAt: !538)
!993 = !DILocation(line: 253, column: 11, scope: !962, inlinedAt: !538)
!994 = !DILocation(line: 253, column: 16, scope: !962, inlinedAt: !538)
!995 = !DILocation(line: 253, column: 22, scope: !962, inlinedAt: !538)
!996 = !DILocation(line: 254, column: 18, scope: !962, inlinedAt: !538)
!997 = !DILocation(line: 254, column: 6, scope: !962, inlinedAt: !538)
!998 = !DILocation(line: 254, column: 16, scope: !962, inlinedAt: !538)
!999 = !DILocation(line: 255, column: 9, scope: !962, inlinedAt: !538)
!1000 = !DILocation(line: 257, column: 9, scope: !1001, inlinedAt: !538)
!1001 = distinct !DILexicalBlock(scope: !962, file: !3, line: 257, column: 9)
!1002 = !DILocation(line: 257, column: 14, scope: !1001, inlinedAt: !538)
!1003 = !DILocation(line: 257, column: 23, scope: !1001, inlinedAt: !538)
!1004 = !DILocation(line: 257, column: 9, scope: !962, inlinedAt: !538)
!1005 = !DILocation(line: 259, column: 7, scope: !1006, inlinedAt: !538)
!1006 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 257, column: 42)
!1007 = !DILocation(line: 261, column: 10, scope: !1008, inlinedAt: !538)
!1008 = distinct !DILexicalBlock(scope: !962, file: !3, line: 261, column: 9)
!1009 = !DILocation(line: 261, column: 9, scope: !1008, inlinedAt: !538)
!1010 = !DILocation(line: 261, column: 19, scope: !1008, inlinedAt: !538)
!1011 = !DILocation(line: 261, column: 9, scope: !962, inlinedAt: !538)
!1012 = !DILocation(line: 262, column: 27, scope: !1013, inlinedAt: !538)
!1013 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 261, column: 36)
!1014 = !DILocation(line: 262, column: 33, scope: !1013, inlinedAt: !538)
!1015 = !DILocation(line: 262, column: 43, scope: !1013, inlinedAt: !538)
!1016 = !DILocation(line: 262, column: 48, scope: !1013, inlinedAt: !538)
!1017 = !DILocalVariable(name: "data", arg: 1, scope: !1018, file: !692, line: 276, type: !47)
!1018 = distinct !DISubprogram(name: "parse_icmp", scope: !692, file: !692, line: 275, type: !693, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !421)
!1019 = !DILocation(line: 276, column: 11, scope: !1018, inlinedAt: !1020)
!1020 = distinct !DILocation(line: 262, column: 16, scope: !1013, inlinedAt: !538)
!1021 = !DILocalVariable(name: "data_end", arg: 2, scope: !1018, file: !692, line: 277, type: !47)
!1022 = !DILocation(line: 277, column: 11, scope: !1018, inlinedAt: !1020)
!1023 = !DILocalVariable(name: "off", arg: 3, scope: !1018, file: !692, line: 278, type: !98)
!1024 = !DILocation(line: 278, column: 11, scope: !1018, inlinedAt: !1020)
!1025 = !DILocalVariable(name: "pckt", arg: 4, scope: !1018, file: !692, line: 279, type: !535)
!1026 = !DILocation(line: 279, column: 32, scope: !1018, inlinedAt: !1020)
!1027 = !DILocalVariable(name: "icmp_hdr", scope: !1018, file: !692, line: 280, type: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr", file: !1030, line: 89, size: 64, elements: !1031)
!1030 = !DIFile(filename: "/usr/include/linux/icmp.h", directory: "", checksumkind: CSK_MD5, checksum: "a505632898dce546638b3344627d334b")
!1031 = !{!1032, !1033, !1034, !1035}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1029, file: !1030, line: 90, baseType: !59, size: 8)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1029, file: !1030, line: 91, baseType: !59, size: 8, offset: 8)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1029, file: !1030, line: 92, baseType: !569, size: 16, offset: 16)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !1029, file: !1030, line: 104, baseType: !1036, size: 32, offset: 32)
!1036 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1029, file: !1030, line: 93, size: 32, elements: !1037)
!1037 = !{!1038, !1043, !1044, !1049}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !1036, file: !1030, line: 97, baseType: !1039, size: 32)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1036, file: !1030, line: 94, size: 32, elements: !1040)
!1040 = !{!1041, !1042}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1039, file: !1030, line: 95, baseType: !445, size: 16)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !1039, file: !1030, line: 96, baseType: !445, size: 16, offset: 16)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "gateway", scope: !1036, file: !1030, line: 98, baseType: !133, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !1036, file: !1030, line: 102, baseType: !1045, size: 32)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1036, file: !1030, line: 99, size: 32, elements: !1046)
!1046 = !{!1047, !1048}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !1045, file: !1030, line: 100, baseType: !445, size: 16)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !1045, file: !1030, line: 101, baseType: !445, size: 16, offset: 16)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1036, file: !1030, line: 103, baseType: !719, size: 32)
!1050 = !DILocation(line: 280, column: 19, scope: !1018, inlinedAt: !1020)
!1051 = !DILocalVariable(name: "iph", scope: !1018, file: !692, line: 281, type: !556)
!1052 = !DILocation(line: 281, column: 17, scope: !1018, inlinedAt: !1020)
!1053 = !DILocation(line: 282, column: 14, scope: !1018, inlinedAt: !1020)
!1054 = !DILocation(line: 282, column: 21, scope: !1018, inlinedAt: !1020)
!1055 = !DILocation(line: 282, column: 19, scope: !1018, inlinedAt: !1020)
!1056 = !DILocation(line: 282, column: 12, scope: !1018, inlinedAt: !1020)
!1057 = !DILocation(line: 283, column: 7, scope: !1058, inlinedAt: !1020)
!1058 = distinct !DILexicalBlock(scope: !1018, file: !692, line: 283, column: 7)
!1059 = !DILocation(line: 283, column: 16, scope: !1058, inlinedAt: !1020)
!1060 = !DILocation(line: 283, column: 22, scope: !1058, inlinedAt: !1020)
!1061 = !DILocation(line: 283, column: 20, scope: !1058, inlinedAt: !1020)
!1062 = !DILocation(line: 283, column: 7, scope: !1018, inlinedAt: !1020)
!1063 = !DILocation(line: 284, column: 5, scope: !1064, inlinedAt: !1020)
!1064 = distinct !DILexicalBlock(scope: !1058, file: !692, line: 283, column: 32)
!1065 = !DILocation(line: 286, column: 7, scope: !1066, inlinedAt: !1020)
!1066 = distinct !DILexicalBlock(scope: !1018, file: !692, line: 286, column: 7)
!1067 = !DILocation(line: 286, column: 17, scope: !1066, inlinedAt: !1020)
!1068 = !DILocation(line: 286, column: 22, scope: !1066, inlinedAt: !1020)
!1069 = !DILocation(line: 286, column: 7, scope: !1018, inlinedAt: !1020)
!1070 = !DILocation(line: 287, column: 28, scope: !1071, inlinedAt: !1020)
!1071 = distinct !DILexicalBlock(scope: !1066, file: !692, line: 286, column: 36)
!1072 = !DILocation(line: 287, column: 34, scope: !1071, inlinedAt: !1020)
!1073 = !DILocalVariable(name: "data", arg: 1, scope: !1074, file: !692, line: 63, type: !47)
!1074 = distinct !DISubprogram(name: "send_icmp_reply", scope: !692, file: !692, line: 62, type: !768, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !421)
!1075 = !DILocation(line: 63, column: 11, scope: !1074, inlinedAt: !1076)
!1076 = distinct !DILocation(line: 287, column: 12, scope: !1071, inlinedAt: !1020)
!1077 = !DILocalVariable(name: "data_end", arg: 2, scope: !1074, file: !692, line: 64, type: !47)
!1078 = !DILocation(line: 64, column: 11, scope: !1074, inlinedAt: !1076)
!1079 = !DILocalVariable(name: "iph", scope: !1074, file: !692, line: 65, type: !556)
!1080 = !DILocation(line: 65, column: 17, scope: !1074, inlinedAt: !1076)
!1081 = !DILocalVariable(name: "icmp_hdr", scope: !1074, file: !692, line: 66, type: !1028)
!1082 = !DILocation(line: 66, column: 19, scope: !1074, inlinedAt: !1076)
!1083 = !DILocalVariable(name: "tmp_addr", scope: !1074, file: !692, line: 67, type: !52)
!1084 = !DILocation(line: 67, column: 9, scope: !1074, inlinedAt: !1076)
!1085 = !DILocalVariable(name: "csum", scope: !1074, file: !692, line: 68, type: !98)
!1086 = !DILocation(line: 68, column: 9, scope: !1074, inlinedAt: !1076)
!1087 = !DILocalVariable(name: "off", scope: !1074, file: !692, line: 69, type: !98)
!1088 = !DILocation(line: 69, column: 9, scope: !1074, inlinedAt: !1076)
!1089 = !DILocation(line: 71, column: 8, scope: !1090, inlinedAt: !1076)
!1090 = distinct !DILexicalBlock(scope: !1074, file: !692, line: 71, column: 7)
!1091 = !DILocation(line: 71, column: 13, scope: !1090, inlinedAt: !1076)
!1092 = !DILocation(line: 71, column: 37, scope: !1090, inlinedAt: !1076)
!1093 = !DILocation(line: 71, column: 60, scope: !1090, inlinedAt: !1076)
!1094 = !DILocation(line: 72, column: 34, scope: !1090, inlinedAt: !1076)
!1095 = !DILocation(line: 72, column: 32, scope: !1090, inlinedAt: !1076)
!1096 = !DILocation(line: 71, column: 7, scope: !1074, inlinedAt: !1076)
!1097 = !DILocation(line: 73, column: 5, scope: !1098, inlinedAt: !1076)
!1098 = distinct !DILexicalBlock(scope: !1090, file: !692, line: 72, column: 44)
!1099 = !DILocation(line: 75, column: 7, scope: !1074, inlinedAt: !1076)
!1100 = !DILocation(line: 76, column: 9, scope: !1074, inlinedAt: !1076)
!1101 = !DILocation(line: 76, column: 16, scope: !1074, inlinedAt: !1076)
!1102 = !DILocation(line: 76, column: 14, scope: !1074, inlinedAt: !1076)
!1103 = !DILocation(line: 76, column: 7, scope: !1074, inlinedAt: !1076)
!1104 = !DILocation(line: 77, column: 7, scope: !1074, inlinedAt: !1076)
!1105 = !DILocation(line: 78, column: 14, scope: !1074, inlinedAt: !1076)
!1106 = !DILocation(line: 78, column: 21, scope: !1074, inlinedAt: !1076)
!1107 = !DILocation(line: 78, column: 19, scope: !1074, inlinedAt: !1076)
!1108 = !DILocation(line: 78, column: 12, scope: !1074, inlinedAt: !1076)
!1109 = !DILocation(line: 79, column: 3, scope: !1074, inlinedAt: !1076)
!1110 = !DILocation(line: 79, column: 13, scope: !1074, inlinedAt: !1076)
!1111 = !DILocation(line: 79, column: 18, scope: !1074, inlinedAt: !1076)
!1112 = !DILocation(line: 83, column: 3, scope: !1074, inlinedAt: !1076)
!1113 = !DILocation(line: 83, column: 13, scope: !1074, inlinedAt: !1076)
!1114 = !DILocation(line: 83, column: 22, scope: !1074, inlinedAt: !1076)
!1115 = !DILocation(line: 84, column: 3, scope: !1074, inlinedAt: !1076)
!1116 = !DILocation(line: 84, column: 8, scope: !1074, inlinedAt: !1076)
!1117 = !DILocation(line: 84, column: 12, scope: !1074, inlinedAt: !1076)
!1118 = !DILocation(line: 85, column: 14, scope: !1074, inlinedAt: !1076)
!1119 = !DILocation(line: 85, column: 19, scope: !1074, inlinedAt: !1076)
!1120 = !DILocation(line: 85, column: 12, scope: !1074, inlinedAt: !1076)
!1121 = !DILocation(line: 86, column: 16, scope: !1074, inlinedAt: !1076)
!1122 = !DILocation(line: 86, column: 21, scope: !1074, inlinedAt: !1076)
!1123 = !DILocation(line: 86, column: 3, scope: !1074, inlinedAt: !1076)
!1124 = !DILocation(line: 86, column: 8, scope: !1074, inlinedAt: !1076)
!1125 = !DILocation(line: 86, column: 14, scope: !1074, inlinedAt: !1076)
!1126 = !DILocation(line: 87, column: 16, scope: !1074, inlinedAt: !1076)
!1127 = !DILocation(line: 87, column: 3, scope: !1074, inlinedAt: !1076)
!1128 = !DILocation(line: 87, column: 8, scope: !1074, inlinedAt: !1076)
!1129 = !DILocation(line: 87, column: 14, scope: !1074, inlinedAt: !1076)
!1130 = !DILocation(line: 88, column: 3, scope: !1074, inlinedAt: !1076)
!1131 = !DILocation(line: 88, column: 8, scope: !1074, inlinedAt: !1076)
!1132 = !DILocation(line: 88, column: 14, scope: !1074, inlinedAt: !1076)
!1133 = !DILocation(line: 89, column: 20, scope: !1074, inlinedAt: !1076)
!1134 = !DILocalVariable(name: "iph", arg: 1, scope: !1135, file: !1136, line: 52, type: !47)
!1135 = distinct !DISubprogram(name: "ipv4_csum_inline", scope: !1136, file: !1136, line: 51, type: !1137, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !421)
!1136 = !DIFile(filename: "lib/bpf/../bpf/csum_helpers.h", directory: "/home/yunwei/ebpf-xdp-dpdk/katran", checksumkind: CSK_MD5, checksum: "77d656b3c2710bb4dac97d75c576b274")
!1137 = !DISubroutineType(types: !1138)
!1138 = !{null, !47, !1139}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!1140 = !DILocation(line: 52, column: 11, scope: !1135, inlinedAt: !1141)
!1141 = distinct !DILocation(line: 89, column: 3, scope: !1074, inlinedAt: !1076)
!1142 = !DILocalVariable(name: "csum", arg: 2, scope: !1135, file: !1136, line: 53, type: !1139)
!1143 = !DILocation(line: 53, column: 12, scope: !1135, inlinedAt: !1141)
!1144 = !DILocalVariable(name: "next_iph_u16", scope: !1135, file: !1136, line: 54, type: !53)
!1145 = !DILocation(line: 54, column: 10, scope: !1135, inlinedAt: !1141)
!1146 = !DILocation(line: 54, column: 33, scope: !1135, inlinedAt: !1141)
